{
  "id": "pb-microsoft365defender-microsoft-365-defender-get-email-url-clicks",
  "title": "Microsoft 365 Defender - Get Email URL Clicks",
  "category": "playbook",
  "content": "This playbook retrieves email data based on the `URLDomain` and `MessageID` inputs. It uses the Microsoft 365 Defender's Advanced Hunting to search only for URL click events based on the playbook inputs and enriches it with the full email data.\n\n**URLDomain** - If the “URLDomain” value is found as a substring of the URL(s) in the body of the email, the email is retrieved.\n\n**MessageID** - The message ID of the email from which the URL was clicked. Note that this can be either of the following 2 values:\n- The value of the header \"Message-ID\".\n- The internal ID of the message within Microsoft's products (e.g., NetworkMessageId).\n\nCan be a single MessageID or an array of MessageIDs to search.\n\nCortex XSOAR/XSIAM SOAR playbook from the Cortex XSOAR pack (Microsoft365Defender, xsoar-supported).\n\nInputs — URLDomain: Represents a domain or URL. Can be a single domain or URL, or an array of domains or URLs to search. The search looks for URLs containing this input that were clicked within emails.; MessageID: MessageID of the email from which the URL was clicked. Note that this can be either of the following 2 values:\n- The value of the header \"Message-ID\".\n- The internal ID of the message within Microsoft's products (e.g., NetworkMessageId).\n\nCan be a single MessageID or an array of MessageIDs to search.; Timeout: The time limit in seconds for the HTTP request to run. Default is 180.; SearchTimeframe: Number of days past to search. Default is 7.; ResultsLimit: Number of retrieved entries. Enter -1 for unlimited query. 50 is the default.; ListenerMailbox: The mailbox of the listening integration. In case it is provided, the emails found in it will be ignored..\n\nOutputs — Microsoft365Defender.RetrievedEmails.UrlCount: Number of embedded URLs in the email.; Microsoft365Defender.RetrievedEmails.InternetMessageId: Public-facing identifier for the email that is set by the sending email system. This is the value of the \"Message-ID\" header.; Microsoft365Defender.RetrievedEmails.SenderFromDomain: Sender domain in the FROM header, which is visible to email recipients on their email clients.; Microsoft365Defender.RetrievedEmails.EmailDirection: Direction of the email relative to your network: Inbound, Outbound, Intra-org.; Microsoft365Defender.RetrievedEmails.AccountUpn: User principal name (UPN) of the account.; Microsoft365Defender.RetrievedEmails.IsClickedThrough: Indicates whether the user was able to click through to the original URL or not.; Microsoft365Defender.RetrievedEmails.DeliveryLocation: Location where the email was delivered: Inbox/Folder, On-premises/External, Junk, Quarantine, Failed, Dropped, Deleted items.; Microsoft365Defender.RetrievedEmails.AuthenticationDetails: List of pass or fail verdicts by email authentication protocols like DMARC, DKIM, SPF or a combination of multiple authentication types (CompAuth).; Microsoft365Defender.RetrievedEmails.DeliveryAction: Delivery action of the email: Delivered, Junked, Blocked, or Replaced.; Microsoft365Defender.RetrievedEmails.BulkComplaintLevel: Threshold assigned to emails from bulk mailers. A high bulk complain level (BCL) means the email is more likely to generate complaints, and thus more likely to be spam..\n\nIntegrations/scripts used: IsIntegrationAvailable, Microsoft 365 Defender, SetAndHandleEmpty.",
  "raw_yaml": "id: Microsoft 365 Defender - Get Email URL Clicks\nversion: -1\nname: Microsoft 365 Defender - Get Email URL Clicks\ndescription: |-\n  This playbook retrieves email data based on the `URLDomain` and `MessageID` inputs. It uses the Microsoft 365 Defender's Advanced Hunting to search only for URL click events based on the playbook inputs and enriches it with the full email data.\n\n  **URLDomain** - If the “URLDomain” value is found as a substring of the URL(s) in the body of the email, the email is retrieved.\n\n  **MessageID** - The message ID of the email from which the URL was clicked. Note that this can be either of the following 2 values:\n  - The value of the header \"Message-ID\".\n  - The internal ID of the message within Microsoft's products (e.g., NetworkMessageId).\n\n  Can be a single MessageID or an array of MessageIDs to search.\nstarttaskid: \"0\"\ntasks:\n  \"0\":\n    id: \"0\"\n    taskid: d1461914-ae1b-4f10-823c-159f52a5e77e\n    type: start\n    task:\n      id: d1461914-ae1b-4f10-823c-159f52a5e77e\n      version: -1\n      name: \"\"\n      iscommand: false\n      brand: \"\"\n      description: ''\n    nexttasks:\n      '#none#':\n      - \"1\"\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 50,\n          \"y\": -20\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"1\":\n    id: \"1\"\n    taskid: e5b1fef1-5ae6-4adc-8325-8598a638ada6\n    type: condition\n    task:\n      id: e5b1fef1-5ae6-4adc-8325-8598a638ada6\n      version: -1\n      name: Check if Microsoft 365 Defender is enabled\n      description: Returns 'yes' if the integration brand is available. Otherwise returns 'no'.\n      scriptName: IsIntegrationAvailable\n      type: condition\n      iscommand: false\n      brand: \"\"\n    nexttasks:\n      \"no\":\n      - \"2\"\n      \"yes\":\n      - \"4\"\n      - \"6\"\n    scriptarguments:\n      brandname:\n        simple: Microsoft 365 Defender\n    results:\n    - brandInstances\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 50,\n          \"y\": 160\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"2\":\n    id: \"2\"\n    taskid: d7d8f920-b7ae-4d22-8967-697d62f48db1\n    type: title\n    task:\n      id: d7d8f920-b7ae-4d22-8967-697d62f48db1\n      version: -1\n      name: Done\n      type: title\n      iscommand: false\n      brand: \"\"\n      description: ''\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 50,\n          \"y\": 1320\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"4\":\n    id: \"4\"\n    taskid: af1be599-0f3e-42b0-8fc8-6bae609463fe\n    type: regular\n    task:\n      id: af1be599-0f3e-42b0-8fc8-6bae609463fe\n      version: -1\n      name: Set URLDomain search argument\n      description: |-\n        Set a value in context under the key you entered. If no value is entered, the script doesn't do anything.\n\n        This automation runs using the default Limited User role, unless you explicitly change the permissions.\n        For more information, see the section about permissions here:\n        - For Cortex XSOAR 6 see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/6.x/Cortex-XSOAR-Playbook-Design-Guide/Automations \n        - For Cortex XSOAR 8 Cloud see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/8/Cortex-XSOAR-Cloud-Documentation/Create-a-script\n        - For Cortex XSOAR 8.7 On-prem see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/8.7/Cortex-XSOAR-On-prem-Documentation/Create-a-script\n      scriptName: SetAndHandleEmpty\n      type: regular\n      iscommand: false\n      brand: \"\"\n    nexttasks:\n      '#none#':\n      - \"9\"\n    scriptarguments:\n      key:\n        simple: URLDomainParsed\n      value:\n        complex:\n          root: inputs.URLDomain\n          transformers:\n          - operator: join\n            args:\n              separator:\n                value:\n                  simple: '|||'\n          - operator: replace\n            args:\n              limit: {}\n              replaceWith:\n                value:\n                  simple: '```, ```'\n              toReplace:\n                value:\n                  simple: '|||'\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 360,\n          \"y\": 390\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 2\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"6\":\n    id: \"6\"\n    taskid: 8677b98b-b313-43ed-87b4-59f6c7bcce85\n    type: regular\n    task:\n      id: 8677b98b-b313-43ed-87b4-59f6c7bcce85\n      version: -1\n      name: Set MessageID search argument\n      description: |-\n        Set a value in context under the key you entered. If no value is entered, the script doesn't do anything.\n\n        This automation runs using the default Limited User role, unless you explicitly change the permissions.\n        For more information, see the section about permissions here:\n        - For Cortex XSOAR 6 see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/6.x/Cortex-XSOAR-Playbook-Design-Guide/Automations \n        - For Cortex XSOAR 8 Cloud see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/8/Cortex-XSOAR-Cloud-Documentation/Create-a-script\n        - For Cortex XSOAR 8.7 On-prem see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/8.7/Cortex-XSOAR-On-prem-Documentation/Create-a-script\n      scriptName: SetAndHandleEmpty\n      type: regular\n      iscommand: false\n      brand: \"\"\n    nexttasks:\n      '#none#':\n      - \"9\"\n    scriptarguments:\n      key:\n        simple: MessageIDParsed\n      value:\n        complex:\n          root: inputs.MessageID\n          transformers:\n          - operator: join\n            args:\n              separator:\n                value:\n                  simple: ', '\n          - operator: replace\n            args:\n              limit: {}\n              replaceWith:\n                value:\n                  simple: '\", \"'\n              toReplace:\n                value:\n                  simple: ', '\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 790,\n          \"y\": 390\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 2\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"7\":\n    id: \"7\"\n    taskid: f147d341-bb0e-4af5-8504-3b725e484f47\n    type: regular\n    task:\n      id: f147d341-bb0e-4af5-8504-3b725e484f47\n      version: -1\n      name: Retrieve emails data (URLDomain)\n      description: 'Advanced hunting is a threat-hunting tool that uses specially constructed queries to examine the past 30 days of event data in Microsoft 365 Defender. Details on how to write queries: https://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-query-language?view=o365-worldwide.'\n      script: Microsoft 365 Defender|||microsoft-365-defender-advanced-hunting\n      type: regular\n      iscommand: true\n      brand: Microsoft 365 Defender\n    nexttasks:\n      '#none#':\n      - \"11\"\n    scriptarguments:\n      limit:\n        complex:\n          root: inputs.ResultsLimit\n      query:\n        simple: let _start = now(-${inputs.SearchTimeframe}d); EmailEvents | where Timestamp >= _start | where RecipientEmailAddress != \"${inputs.ListenerMailbox}\" | join UrlClickEvents on NetworkMessageId | where Url has_any (```${URLDomainParsed}```) |  project-away AdditionalFields, EmailActionPolicy, UserLevelPolicy, EmailActionPolicyGuid, OrgLevelPolicy, UserLevelAction, EmailClusterId, ReportId, ReportId1, OrgLevelAction, SenderObjectId, NetworkMessageId1, DetectionMethods1, ThreatTypes1 |  project-rename ClickTimestamp = Timestamp1\n      timeout:\n        simple: ${inputs.Timeout}\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 360,\n          \"y\": 880\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"8\":\n    id: \"8\"\n    taskid: 09df3e7d-c6e7-40b2-8fe7-30834d9ee2d7\n    type: regular\n    task:\n      id: 09df3e7d-c6e7-40b2-8fe7-30834d9ee2d7\n      version: -1\n      name: Retrieve emails data (MessageID)\n      description: 'Advanced hunting is a threat-hunting tool that uses specially constructed queries to examine the past 30 days of event data in Microsoft 365 Defender. Details on how to write queries: https://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-query-language?view=o365-worldwide.'\n      script: Microsoft 365 Defender|||microsoft-365-defender-advanced-hunting\n      type: regular\n      iscommand: true\n      brand: Microsoft 365 Defender\n    nexttasks:\n      '#none#':\n      - \"11\"\n    scriptarguments:\n      limit:\n        complex:\n          root: inputs.ResultsLimit\n      query:\n        simple: let _start = now(-${inputs.SearchTimeframe}d); EmailEvents | where Timestamp >= _start | where (InternetMessageId in (\"${MessageIDParsed}\") or NetworkMessageId in (\"${MessageIDParsed}\")) | join UrlClickEvents on NetworkMessageId | where RecipientEmailAddress != \"${inputs.ListenerMailbox}\" | project-away AdditionalFields, EmailActionPolicy, UserLevelPolicy, EmailActionPolicyGuid, OrgLevelPolicy, UserLevelAction, EmailClusterId, ReportId, ReportId1, OrgLevelAction, SenderObjectId, NetworkMessageId1, DetectionMethods1, ThreatTypes1 |  project-rename ClickTimestamp = Timestamp1\n      timeout:\n        simple: ${inputs.Timeout}\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 790,\n          \"y\": 880\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"9\":\n    id: \"9\"\n    taskid: afacdf6d-6f79-4824-8ed6-f4c8d7da2c58\n    type: condition\n    task:\n      id: afacdf6d-6f79-4824-8ed6-f4c8d7da2c58\n      version: -1\n      name: Check inputs\n      type: condition\n      iscommand: false\n      brand: \"\"\n      description: \"\"\n    nexttasks:\n      '#default#':\n      - \"2\"\n      MessageID:\n      - \"8\"\n      MessageID and URLDomain:\n      - \"10\"\n      URLDomain:\n      - \"7\"\n    separatecontext: false\n    conditions:\n    - label: URLDomain\n      condition:\n      - - operator: isNotEmpty\n          left:\n            value:\n              complex:\n                root: inputs.URLDomain\n            iscontext: true\n          right:\n            value: {}\n      - - operator: isEmpty\n          left:\n            value:\n              complex:\n                root: inputs.MessageID\n            iscontext: true\n    - label: MessageID\n      condition:\n      - - operator: isNotEmpty\n          left:\n            value:\n              complex:\n                root: inputs.MessageID\n            iscontext: true\n      - - operator: isEmpty\n          left:\n            value:\n              complex:\n                root: inputs.URLDomain\n            iscontext: true\n    - label: MessageID and URLDomain\n      condition:\n      - - operator: isNotEmpty\n          left:\n            value:\n              complex:\n                root: inputs.URLDomain\n            iscontext: true\n      - - operator: isNotEmpty\n          left:\n            value:\n              complex:\n                root: inputs.MessageID\n            iscontext: true\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 790,\n          \"y\": 610\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"10\":\n    id: \"10\"\n    taskid: 91425086-ae2b-4662-84a5-71ce6f06c20a\n    type: regular\n    task:\n      id: 91425086-ae2b-4662-84a5-71ce6f06c20a\n      version: -1\n      name: Retrieve emails data (MessageID and URLDomain)\n      description: 'Advanced hunting is a threat-hunting tool that uses specially constructed queries to examine the past 30 days of event data in Microsoft 365 Defender. Details on how to write queries: https://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-query-language?view=o365-worldwide.'\n      script: Microsoft 365 Defender|||microsoft-365-defender-advanced-hunting\n      type: regular\n      iscommand: true\n      brand: Microsoft 365 Defender\n    nexttasks:\n      '#none#':\n      - \"11\"\n    scriptarguments:\n      limit:\n        complex:\n          root: inputs.ResultsLimit\n      query:\n        simple: let _start = now(-${inputs.SearchTimeframe}d); EmailEvents | where Timestamp >= _start | where RecipientEmailAddress != \"${inputs.ListenerMailbox}\" | join UrlClickEvents on NetworkMessageId | where (InternetMessageId in (\"${MessageIDParsed}\") or NetworkMessageId in (\"${MessageIDParsed}\")) and Url has_any (```${URLDomainParsed}```)  | project-away AdditionalFields, EmailActionPolicy, UserLevelPolicy, EmailActionPolicyGuid, OrgLevelPolicy, UserLevelAction, EmailClusterId, ReportId, ReportId1, OrgLevelAction, SenderObjectId, NetworkMessageId1, DetectionMethods1, ThreatTypes1 | project-rename ClickTimestamp = Timestamp1\n      timeout:\n        simple: ${inputs.Timeout}\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 1210,\n          \"y\": 880\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"11\":\n    id: \"11\"\n    taskid: 8fabf2a2-8171-4794-85ca-d42d4f78b7eb\n    type: regular\n    task:\n      id: 8fabf2a2-8171-4794-85ca-d42d4f78b7eb\n      version: -1\n      name: Set RetrievedEmails field\n      description: |-\n        Set a value in context under the key you entered. If no value is entered, the script doesn't do anything.\n\n        This automation runs using the default Limited User role, unless you explicitly change the permissions.\n        For more information, see the section about permissions here:\n        - For Cortex XSOAR 6 see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/6.x/Cortex-XSOAR-Playbook-Design-Guide/Automations \n        - For Cortex XSOAR 8 Cloud see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/8/Cortex-XSOAR-Cloud-Documentation/Create-a-script\n        - For Cortex XSOAR 8.7 On-prem see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/8.7/Cortex-XSOAR-On-prem-Documentation/Create-a-script\n      scriptName: SetAndHandleEmpty\n      type: regular\n      iscommand: false\n      brand: \"\"\n    nexttasks:\n      '#none#':\n      - \"2\"\n    scriptarguments:\n      key:\n        simple: Microsoft365Defender.RetrievedEmails\n      value:\n        complex:\n          root: Microsoft365Defender.Hunt\n          accessor: results\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 790,\n          \"y\": 1100\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\nview: |-\n  {\n    \"linkLabelsPosition\": {\n      \"1_2_no\": 0.29,\n      \"9_10_MessageID and URLDomain\": 0.6,\n      \"9_2_#default#\": 0.51\n    },\n    \"paper\": {\n      \"dimensions\": {\n        \"height\": 1405,\n        \"width\": 1540,\n        \"x\": 50,\n        \"y\": -20\n      }\n    }\n  }\ninputs:\n- key: URLDomain\n  value: {}\n  required: false\n  description: Represents a domain or URL. Can be a single domain or URL, or an array of domains or URLs to search. The search looks for URLs containing this input that were clicked within emails.\n  playbookInputQuery:\n- key: MessageID\n  value: {}\n  required: false\n  description: |-\n    MessageID of the email from which the URL was clicked. Note that this can be either of the following 2 values:\n    - The value of the header \"Message-ID\".\n    - The internal ID of the message within Microsoft's products (e.g., NetworkMessageId).\n\n    Can be a single MessageID or an array of MessageIDs to search.\n  playbookInputQuery:\n- key: Timeout\n  value:\n    simple: \"180\"\n  required: false\n  description: The time limit in seconds for the HTTP request to run. Default is 180.\n  playbookInputQuery:\n- key: SearchTimeframe\n  value:\n    simple: \"7\"\n  required: false\n  description: Number of days past to search. Default is 7.\n  playbookInputQuery:\n- key: ResultsLimit\n  value:\n    simple: \"50\"\n  required: false\n  description: Number of retrieved entries. Enter -1 for unlimited query. 50 is the default.\n  playbookInputQuery:\n- key: ListenerMailbox\n  value: {}\n  required: false\n  description: The mailbox of the listening integration. In case it is provided, the emails found in it will be ignored.\n  playbookInputQuery:\noutputs:\n- contextPath: Microsoft365Defender.RetrievedEmails.UrlCount\n  description: Number of embedded URLs in the email.\n  type: number\n- contextPath: Microsoft365Defender.RetrievedEmails.InternetMessageId\n  description: Public-facing identifier for the email that is set by the sending email system. This is the value of the \"Message-ID\" header.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.SenderFromDomain\n  description: Sender domain in the FROM header, which is visible to email recipients on their email clients.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.EmailDirection\n  description: 'Direction of the email relative to your network: Inbound, Outbound, Intra-org.'\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.AccountUpn\n  description: User principal name (UPN) of the account.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.IsClickedThrough\n  description: Indicates whether the user was able to click through to the original URL or not.\n  type: number\n- contextPath: Microsoft365Defender.RetrievedEmails.DeliveryLocation\n  description: 'Location where the email was delivered: Inbox/Folder, On-premises/External, Junk, Quarantine, Failed, Dropped, Deleted items.'\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.AuthenticationDetails\n  description: List of pass or fail verdicts by email authentication protocols like DMARC, DKIM, SPF or a combination of multiple authentication types (CompAuth).\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.DeliveryAction\n  description: 'Delivery action of the email: Delivered, Junked, Blocked, or Replaced.'\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.BulkComplaintLevel\n  description: Threshold assigned to emails from bulk mailers. A high bulk complain level (BCL) means the email is more likely to generate complaints, and thus more likely to be spam.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.Subject\n  description: Subject of the email.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.AttachmentCount\n  description: Number of attachments in the email.\n  type: number\n- contextPath: Microsoft365Defender.RetrievedEmails.IPAddress\n  description: IP address assigned to the device during communication.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.DetectionMethods\n  description: Methods used to detect whether the URL contains or leads to malware, phishing, or other threats.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.ThreatNames\n  description: Detection name for malware or other threats found.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.Url\n  description: URL that was clicked.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.ActionType\n  description: Type of activity that triggered the event.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.RecipientEmailAddress\n  description: Email address of the recipient, or email address of the recipient after distribution list expansion.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.EmailAction\n  description: 'Final action taken on the email based on filter verdict, policies, and user actions: Move message to junk mail folder, Add X-header, Modify subject, Redirect message, Delete message, Send to quarantine, No action taken, Bcc message.'\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.UrlChain\n  description: List of URLs in the redirection chain.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.NetworkMessageId\n  description: Unique identifier for the email, generated by Office 365.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.SenderFromAddress\n  description: Sender email address in the FROM header, which is visible to email recipients on their email clients.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.Timestamp\n  description: Date and time when the record was generated (email event).\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.DisplayName\n  description: Name of the sender displayed in the address book, typically a combination of a given or first name, a middle initial, and a last name or surname.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.SenderIPv4\n  description: IPv4 address of the last detected mail server that relayed the message.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.ConfidenceLevel\n  description: List of confidence levels of any spam or phishing verdicts. For spam, this column shows the spam confidence level (SCL), indicating if the email was skipped (-1), found to be not spam (0,1), found to be spam with moderate confidence (5,6), or found to be spam with high confidence (9). For phishing, this column displays whether the confidence level is \"High\" or \"Low\".\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.SenderMailFromDomain\n  description: Sender domain in the MAIL FROM header, also known as the envelope sender or the Return-Path address.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.SenderIPv6\n  description: IPv6 address of the last detected mail server that relayed the message.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.SenderMailFromAddress\n  description: Sender email address in the MAIL FROM header, also known as the envelope sender or the Return-Path address.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.ThreatTypes\n  description: Verdict from the email filtering stack on whether the email contains malware, phishing, or other threats.\n  type: unknown\n- contextPath: Microsoft365Defender.RetrievedEmails\n  description: Email objects containing relevant fields related to URL click events.\n  type: string\n- contextPath: Microsoft365Defender.RetrievedEmails.ClickTimestamp\n  description: Date and time when the record was generated (URL click).\n  type: unknown\ntests:\n- No tests (auto formatted)\nfromversion: 6.5.0\nsupportedModules:\n- agentix\n- xsiam\n- edr\n- cloud\n- cloud_runtime_security\n",
  "product": "Cortex XSOAR",
  "pack": "Microsoft365Defender",
  "support_tier": "xsoar",
  "use_cases": [],
  "fromversion": "6.5.0",
  "source_repo": "demisto/content (MIT)",
  "tags": [
    "network-security",
    "playbook",
    "product:cortex-xsoar",
    "soar",
    "support:xsoar"
  ],
  "embedding_model": "text-embedding-004",
  "embedding": "sFAxPZyfGj3HeSS9zqjRPLs7lz07yDc92ptZPSupSb2xibS8IkuAvGfUVrznWVs9uBEOPZwEqrzsTac8GoUovR5fFT1b4ho9QdZ/vfN9WL3HODG9A9QqO+9tC7yDXXs8q0o2O1eG9rwe25s8v57rOc9CEL2uN/o8dB4fPZWiZj00CSu8uv4lvZdcLTwa6cg7LbYCPPodCr29gTe9dreAvaN4cb0IZ6O7gMT/vBiETj1ijQq9FENhu6AfpzomUQY9sEB+vd0HUz0c/Io9ohowvXNfC70E8i89xZ+APJe1Nb0TUPk79FgfvS/eobys1xu9qvxZulscVb1UCxQ9aKFEvOUHKT1Gcvy8MtAXvccKBL3l+KW9FqyLPaOxjLwoxK09fXEEvO05aDvlNVq8Ox5tvO9aLD0/AFe7O+gKPd4LLzzFsK28qU/5O+oyBz2wL4o8VTwKveCVsjxVJFm8znEZvZ1NMb07fwK9RWi5Pab9/7sc/jC94pOEPcInpT05NsW8q4ZJvS1Slr0kw0Y9GZk9PMwDnbzHc8i5uXx4PFavyryPJOg8NgUFvBbAHr1vcqK9M21svWMZ0jxFk788vRWrO0xYQz0Ry6I8BWCLvOWDYTzSBlC84dyxPI+hATkrdpC9IcSPu5sdXD3PLNE8WPqMPWexOz1E5BY9wbYZPZaRJL1gBp26JN4zPGTVvLualQS9YHRNO0/qB73nlhu9+rruvNMYlj10GPK8N6GWvIjdMroh3/e7geFwvOth2b2PBYo7XwzSPKyjB73UICI9BgSUPVTTSrzB55K7mPytvNmKqbyjnY26rBRiuqI5H7yRJ/g8cIBWux4jcr0e+wY9O9gpvMDCjzxDkoq9nkJJO+CsMT0DZwS92KsWvHXPMb31D1+8FBGYvPM0Aj3xWLQ8AlcqvUWemr0lVWe9dm6avNDQSj33yl27/iA3u6XcEr28Dv+8sNWiPQahijzhUgY9t2NRvUBvV7yQv5+8qD4tPBL3JzzIPaw8+K6pPVIRqzvip267nNLZPHYyij11j3K9iJobvNmA6zwc+KE6m6a6vOEm2Lw623Y9EwfXPOIJgbwPM6i9EHtVvbtnPbyMn4y9IgmTvIcLLzwqOcG8K3exu/vl6js9cJe8kK3BvGRcYbwwwaw6PVWqPCcJRD1hY7U9fgaPuyoVGD3rVCo8PeAevZNdwzzTIxG8MjOgPeajf7315Q48/EPdO71vtb1xZRm8GX7fPPEtG71dXjs8B1dSu9SFPTxH5SU9umq5vEE7cL2fUqs7qecCvent4TwuYRo8PYy4vHZOBT3y5XO8mx7zPD9e+LrKwUO8XvxRvVOqmbzeeSe5szL+vPAUaTwswpq8kOidPESNqDx0HDG9cTpEu+P3zby+/Q49hOxevKfVnLw761+9AKUfO79Gkb1j7Um97LEPvVaiZD3nqD08ai5OPb+TPbwo9g69/fKtuy66cb30wyM8neg0vWS+4zzjsKW9h0/IvKMS9DvLB567fJ/iPEO6VrzuOq88OgeCvY9s3TpzlTO9aZeQO2uhXr3Bej09nJByPSyLRb19iFi8Hq5uPVllTDwu9Sw9tkmoPW4+uLxL7sE6R88RPYeG6TzEDsW8jesbPRLFYLyUyGc7wejTN9pmCjy8l4W7pbILuzMO9jyHk+y8T9sYvEgMO7ydJi+8kl+qOwZ58b19U+G8YHwbvEGS8LxknvY7PqZWPFtWMr3JK1Q9cLC5vEb1HL0mH5e6yZYkvQ7zkzxgp728JDSgO39xDjx9h187RlBvPCtpgDyfGMc79AMdvfqPFT2plUA9f/zkvB1TDzyvgB08DFc+PGNcIbxyfqG7csUVvJ/cnrxMTCG80R6CPaV4Cz1OjYA8+zxCPdK+oLxcOIG6TmLnPNR9lTw6sRE9XLdlvM6/e7uTuL48Zr7jPHNdlDxH4Zk8IW2CPWm7ULzpQwa9p8ptPQhrIz2J5ck7Rqz4vLt6l7zHowa8c9t/PEm7frsPcZq7/uGKvVvjib2i+Us8aX66vFhLor0Zawu9EPnhOzv4ib3H6XQ8gs4gOmrZ0D0RrEa9rOrZPPVKNTxuNg680IWIvbXPmD1t5uI8ENYnPQx0B717A/y7p51svDHfQT3/m0k9LiUQvQ5zqjxjHt+8WQ8VPT+NS7zn0428I1imPP5OjD3KRfS6fEW0vAkU8bqKjB081o/MvI5457vhjyM9cCzAvFoU9rtTsic9iu3VO+IF+zvUho09j9KcvNxntTvFAxK88vIvvFJ50buXsqK9FRBWve99mrx9/Tg9sOedupBsq7wU9iI9faaoO4lI+jztTFW9KFeDvL8S1TxqrY68KJZ9vJdf6Twu2NA7M721PEyinz2pIiQ9gpE4vfWi3Trepha7AEAIPFjQmjqhOfi8Uy3APNKu47vzAoM8/eEdvTgdy704cAW8hH2cPNMkjzyuSCu9BrFfvE7rbL27YyO8pQiBPbON9zvFLcm8qtScOmRZAr1JkM094WYDPc79mz3vIyw9KFidPcqdZjxestI8HRhCvU6SMLyidm88fd2yuxkb5btWWEE7quxJvYt3WLzZQOm6Gw3EOpclbz1yH0e9jrC0vHf+Fzxz1NI84TsoPC/fi73K56q8Qqg8vRnaQruWWqI6HRSqvYEdyjxjeeW7h9ALPGPQiD1YE6E95RVPPbneaTxATOy87RwEvThRBj1HDTO9ytOEPJtfhTv08jQ9UZ/EPK7yx7yKS1k9ywNqvHAa+bvCVKs8jkzYPJwK1rxZJyM93octPZE8uryMLTS8W6UXPN/sIr2p8K+7clFxO8MwozylRZi86gn4u3b4MzziltW8VHqVPY12Jzt/XRU9CXfoO5v+HT2uI5E9NFHfPO/WlT3m9ik9+OVKPM0FLD0iEC09jwv/vLPQNzwDlAw9vbwrvHQU0zuURPe8jyCpPfdNeL0mWZq8V2sWu82NAjumkdw8LUJYvYJejzypceu8nG5jvF0swrssBTc9YjUivZBZarwo1jQ9DbeFvWYr1rzdIZG9R/EaPSzXuLvoSx09tLssPZqKhbva65s8H43yvIqyvbu+/zW9dip9PJ9igLx2c648xfMVPF3NljzTkis88WhIPQaJ+7olYxa9vAf2uVwPuLzeMDi86PqmvOUZ+juC6jc7iRcivNpczDxaBNi8T2mEPNpbkbylwUC96jgNPIxZv7uFi2E8+jAOvU9uN73bxp09qUTvvHXJt70N4Y69+1WuvK6Kb7186Nc8XEKRPEA0lbzCkXY9e4oVOwBUTr1hSSu9hZdAPYVLWryWAPC8yqTWu4tIgTsC7Bs9h4vgvJv7Ez3BPwE9IWy1vFLifDoGox+9OBB/Oj2ohjsvyrw8uCuFuYOTjrunGIc9C6d/vSDTkrtwLPG8W7e/O12JeTu4P8Q8rnIevTtaGj135Ly8hO2EPQ5jGj17RaK9JvMFPZgVCzzg0Ty9NQrCO91rUzzMlpM8KLQbPajEI72o56k8OI1ava/x0ztD1rG7UogIPKQfGD3ofzK9Say3PK29Tr2KM769ri4sPRp6Tr0NpzA9M+QGvUkzdbwzbsY8HltYPGLN1btP2t48YWpqPVtKpT0Mg967zA8mPITr9zsf+3g971bZvGPfH73lZ/Q8rLXavCF0lT2ZOco8Xj9JPA+ftbzjMR09QwzKvMKxh7zjNsM7Z5IFvGzU0ztLaV883VIAvMRS9zxrkgc9xdSgvFezgrwVBL67g3ySOtratryqx1a6AVavu3sJsLuUXCk7KpWcu8EslDx6nWw927vgvaUEHjx60ya9jhd7PMYClToY+Zs82c3VPGMNSjxqYS88aOanPB8E0DwYHlk6DTYJPRsEjbyvxR09cLiFPcxSCTyUpDY8dOabvOCNfLyczwW9/gF6vB8KrDzmSB89ouqkvCoJCz1WfdE80MQSu7/3vry2UA69hCBVvWUf9bxym1w9wiwrvZTe2rzAyLA8LMxyvPEaaj1Lyd67PzmOu8m36LsSFIe9BkjMvZ19Or3duK+8j4euvMBjODz1aQ28xDh9vPgXN73VH0M9HI1quVB0+LwchbE8p8OevPs3e7yrNFi9fvxWvdvdxDxOfpU6"
}
