{
  "id": "pb-microsoftdefenderadvancedthr-mde-search-and-block-software",
  "title": "MDE - Search And Block Software",
  "category": "playbook",
  "content": "This playbook will search a file or process activity of a software by a given image file name using Microsoft Defender For Endpoint. The analyst can then choose the files to block.\n\nCortex XSOAR/XSIAM SOAR playbook from the Cortex XSOAR pack (MicrosoftDefenderAdvancedThreatProtection, xsoar-supported).\n\nInputs — Filename: File name to search; TimeFrame: Time in relative date or range format (for example: \"1 day\", \"3 weeks ago\", \"between 2021-01-01 12:34:56 +02:00 and 2021-02-01 12:34:56 +02:00\"). The default is the last 24 hours.; Defender Indicator Title: The indicator alert title in Defender.; Indicator Expiration: DateTime string indicating when the indicator expires. Format: (<number> <time unit>, e.g., 12 hours, 7 days)..\n\nIntegrations/scripts used: JsonToTable, Set, microsoft-atp-advanced-hunting, microsoft-atp-sc-indicator-create.",
  "raw_yaml": "id: MDE - Search And Block Software\nversion: -1\nname: MDE - Search And Block Software\ndescription: This playbook will search a file or process activity of a software by a given image file name using Microsoft Defender For Endpoint. The analyst can then choose the files to block.\nstarttaskid: \"0\"\ntasks:\n  \"0\":\n    id: \"0\"\n    taskid: e2462455-b6f1-4456-847a-8d2cbfe68e11\n    type: start\n    task:\n      id: e2462455-b6f1-4456-847a-8d2cbfe68e11\n      version: -1\n      name: \"\"\n      iscommand: false\n      brand: \"\"\n      description: ''\n    nexttasks:\n      '#none#':\n      - \"31\"\n      - \"32\"\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 440,\n          \"y\": -330\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"3\":\n    id: \"3\"\n    taskid: f16ed52e-b396-43c3-85e0-74ca45de4ce0\n    type: condition\n    task:\n      id: f16ed52e-b396-43c3-85e0-74ca45de4ce0\n      version: -1\n      name: Has query results?\n      type: condition\n      iscommand: false\n      brand: \"\"\n      description: ''\n    nexttasks:\n      '#default#':\n      - \"6\"\n      \"yes\":\n      - \"26\"\n    separatecontext: false\n    conditions:\n    - label: \"yes\"\n      condition:\n      - - operator: isNotEmpty\n          left:\n            value:\n              complex:\n                root: MicrosoftATP.Hunt\n                accessor: Result\n            iscontext: true\n          right:\n            value: {}\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 990,\n          \"y\": 520\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"4\":\n    id: \"4\"\n    taskid: 2b9111c4-c7f3-4aff-8722-cb0e0de16aa9\n    type: title\n    task:\n      id: 2b9111c4-c7f3-4aff-8722-cb0e0de16aa9\n      version: -1\n      name: Done\n      type: title\n      iscommand: false\n      brand: \"\"\n      description: ''\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 440,\n          \"y\": 2390\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"6\":\n    id: \"6\"\n    taskid: 7ed6724b-75d4-45c8-8a3d-e39ffa900e22\n    type: regular\n    task:\n      id: 7ed6724b-75d4-45c8-8a3d-e39ffa900e22\n      version: -1\n      name: delete context - XDR Results\n      description: |-\n        Delete field from context.\n\n        This automation runs using the default Limited User role, unless you explicitly change the permissions.\n        For more information, see the section about permissions here:\n        - For Cortex XSOAR 6 see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/6.x/Cortex-XSOAR-Playbook-Design-Guide/Automations \n        - For Cortex XSOAR 8 Cloud see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/8/Cortex-XSOAR-Cloud-Documentation/Create-a-script\n        - For Cortex XSOAR 8.7 On-prem see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/8.7/Cortex-XSOAR-On-prem-Documentation/Create-a-script\n      scriptName: DeleteContext\n      type: regular\n      iscommand: false\n      brand: \"\"\n    nexttasks:\n      '#none#':\n      - \"21\"\n    scriptarguments:\n      key:\n        simple: PaloAltoNetworksXQL\n      subplaybook:\n        simple: \"yes\"\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 740,\n          \"y\": 1890\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"14\":\n    id: \"14\"\n    taskid: 204f5af9-ee11-4c34-8429-3d0cc19a3685\n    type: condition\n    task:\n      id: 204f5af9-ee11-4c34-8429-3d0cc19a3685\n      version: -1\n      name: Has software name and timeframe from input?\n      type: condition\n      iscommand: false\n      brand: \"\"\n      description: ''\n    nexttasks:\n      '#default#':\n      - \"6\"\n      \"yes\":\n      - \"15\"\n    separatecontext: false\n    conditions:\n    - label: \"yes\"\n      condition:\n      - - operator: isNotEmpty\n          left:\n            value:\n              complex:\n                root: inputs.Filename\n            iscontext: true\n          right:\n            value: {}\n      - - operator: isNotEmpty\n          left:\n            value:\n              complex:\n                root: inputs.TimeFrame\n            iscontext: true\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 740,\n          \"y\": 170\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"15\":\n    id: \"15\"\n    taskid: acdbc23e-ea80-4a6f-86a6-b210df33031d\n    type: regular\n    task:\n      id: acdbc23e-ea80-4a6f-86a6-b210df33031d\n      version: -1\n      name: Execute KQL query to search software\n      description: 'Allows you to run programmatic queries like in Microsoft Defender ATP Portal (https://securitycenter.windows.com/hunting). Limitations: You can only run a query on data from the last 30 days. The results include a maximum of 10,000 rows. The number of executions is limited (up to 15 calls per minute, 15 minutes of running time every hour and 4 hours of running time a day).'\n      script: '|||microsoft-atp-advanced-hunting'\n      type: regular\n      iscommand: true\n      brand: \"\"\n    nexttasks:\n      '#none#':\n      - \"3\"\n    scriptarguments:\n      query:\n        simple: |-\n          DeviceProcessEvents\n          | where FileName in~ (\"${inputs.Filename}\")\n          | project FileName, ProcessCreationTime, DeviceName, FolderPath, SHA256\n      time_range:\n        complex:\n          root: inputs.TimeFrame\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 990,\n          \"y\": 350\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"16\":\n    id: \"16\"\n    taskid: e1cad07d-ecc9-448d-8dfe-1b414f4d1f2b\n    type: collection\n    task:\n      id: e1cad07d-ecc9-448d-8dfe-1b414f4d1f2b\n      version: -1\n      name: Would you like to block the files found?\n      type: collection\n      iscommand: false\n      brand: \"\"\n      description: ''\n    nexttasks:\n      '#none#':\n      - \"17\"\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 1220,\n          \"y\": 850\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    message:\n      to:\n      subject:\n      body:\n      methods: []\n      format: \"\"\n      bcc:\n      cc:\n      timings:\n        retriescount: 2\n        retriesinterval: 360\n        completeafterreplies: 1\n        completeafterv2: true\n        completeaftersla: false\n    form:\n      questions:\n      - id: \"0\"\n        label: \"\"\n        labelarg:\n          simple: Would you like to block the files found?\n        required: false\n        gridcolumns: []\n        defaultrows: []\n        type: singleSelect\n        options: []\n        optionsarg:\n        - simple: Yes - All\n        - simple: Yes - Choose specific files\n        - simple: \"No\"\n        fieldassociated: \"\"\n        placeholder: \"\"\n        tooltip: \"\"\n        readonly: false\n      title: Would you like to block the files found?\n      description: \"\"\n      sender: \"\"\n      expired: false\n      totalanswers: 0\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"17\":\n    id: \"17\"\n    taskid: 0d2ff43d-695e-4cac-8dad-b19811c882e6\n    type: condition\n    task:\n      id: 0d2ff43d-695e-4cac-8dad-b19811c882e6\n      version: -1\n      name: Block the files?\n      type: condition\n      iscommand: false\n      brand: \"\"\n      description: ''\n    nexttasks:\n      '#default#':\n      - \"6\"\n      Yes - Choose specific files:\n      - \"18\"\n      \"yes\":\n      - \"19\"\n    separatecontext: false\n    conditions:\n    - label: \"yes\"\n      condition:\n      - - operator: isEqualString\n          left:\n            value:\n              complex:\n                root: Would you like to block the files found?.Answers\n                accessor: \"0\"\n            iscontext: true\n          right:\n            value:\n              simple: \"Yes\"\n          ignorecase: true\n    - label: Yes - Choose specific files\n      condition:\n      - - operator: isEqualString\n          left:\n            value:\n              complex:\n                root: Would you like to block the files found?.Answers\n                accessor: \"0\"\n            iscontext: true\n          right:\n            value:\n              simple: Yes - Choose specific files\n          ignorecase: true\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 1220,\n          \"y\": 1020\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"18\":\n    id: \"18\"\n    taskid: d901ba98-06ad-476a-8bfc-13a7984e9b35\n    type: collection\n    task:\n      id: d901ba98-06ad-476a-8bfc-13a7984e9b35\n      version: -1\n      name: Choose specific files to block\n      type: collection\n      iscommand: false\n      brand: \"\"\n      description: ''\n    nexttasks:\n      '#none#':\n      - \"24\"\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 1650,\n          \"y\": 1200\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    message:\n      to:\n      subject:\n      body:\n      methods: []\n      format: \"\"\n      bcc:\n      cc:\n      timings:\n        retriescount: 2\n        retriesinterval: 360\n        completeafterreplies: 1\n        completeafterv2: true\n        completeaftersla: false\n    form:\n      questions:\n      - id: \"0\"\n        label: \"\"\n        labelarg:\n          simple: Choose specific files to block\n        required: false\n        gridcolumns: []\n        defaultrows: []\n        type: multiSelect\n        options: []\n        optionsarg:\n        - complex:\n            root: MicrosoftATP.Hunt.Result\n            accessor: FolderPath\n        - {}\n        fieldassociated: \"\"\n        placeholder: \"\"\n        tooltip: \"\"\n        readonly: false\n      title: Choose specific files to block\n      description: \"\"\n      sender: \"\"\n      expired: false\n      totalanswers: 0\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"19\":\n    id: \"19\"\n    taskid: e1a29a81-6e8b-4964-8378-317d6da13486\n    type: regular\n    task:\n      id: e1a29a81-6e8b-4964-8378-317d6da13486\n      version: -1\n      name: Set Indicators To Block\n      description: Set a value in context under the key you entered.\n      scriptName: Set\n      type: regular\n      iscommand: false\n      brand: \"\"\n    nexttasks:\n      '#none#':\n      - \"29\"\n    scriptarguments:\n      key:\n        simple: IndicatorsToBlock\n      value:\n        complex:\n          root: MicrosoftATP.Hunt.Result\n          accessor: SHA256\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 1220,\n          \"y\": 1200\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"21\":\n    id: \"21\"\n    taskid: dbca7f71-0386-4a09-82b3-7127aa1272d3\n    type: regular\n    task:\n      id: dbca7f71-0386-4a09-82b3-7127aa1272d3\n      version: -1\n      name: delete context - Indicators To block\n      description: |-\n        Delete field from context.\n\n        This automation runs using the default Limited User role, unless you explicitly change the permissions.\n        For more information, see the section about permissions here:\n        - For Cortex XSOAR 6 see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/6.x/Cortex-XSOAR-Playbook-Design-Guide/Automations \n        - For Cortex XSOAR 8 Cloud see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/8/Cortex-XSOAR-Cloud-Documentation/Create-a-script\n        - For Cortex XSOAR 8.7 On-prem see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/8.7/Cortex-XSOAR-On-prem-Documentation/Create-a-script\n      scriptName: DeleteContext\n      type: regular\n      iscommand: false\n      brand: \"\"\n    nexttasks:\n      '#none#':\n      - \"27\"\n    scriptarguments:\n      key:\n        simple: PaloAltoNetworksXQL\n      subplaybook:\n        simple: \"yes\"\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 740,\n          \"y\": 2055\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"23\":\n    id: \"23\"\n    taskid: 0eeeff57-dc6a-48f0-828f-2742507e80f2\n    type: regular\n    task:\n      id: 0eeeff57-dc6a-48f0-828f-2742507e80f2\n      version: -1\n      name: Set Indicators To Block - Process\n      description: Set a value in context under the key you entered.\n      scriptName: Set\n      type: regular\n      iscommand: false\n      brand: \"\"\n    nexttasks:\n      '#none#':\n      - \"29\"\n    scriptarguments:\n      append:\n        simple: \"true\"\n      key:\n        simple: IndicatorsToBlock\n      value:\n        complex:\n          root: MicrosoftATP.Hunt.Result\n          filters:\n          - - operator: in\n              left:\n                value:\n                  simple: MicrosoftATP.Hunt.Result.FolderPath\n                iscontext: true\n              right:\n                value:\n                  simple: Choose specific files to block.Answers.0\n                iscontext: true\n              ignorecase: true\n          accessor: SHA256\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 1650,\n          \"y\": 1540\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"24\":\n    id: \"24\"\n    taskid: 04f5195a-5602-41dd-8161-23a159aabede\n    type: condition\n    task:\n      id: 04f5195a-5602-41dd-8161-23a159aabede\n      version: -1\n      name: Has relevant files to block?\n      type: condition\n      iscommand: false\n      brand: \"\"\n      description: ''\n    nexttasks:\n      '#default#':\n      - \"29\"\n      \"yes\":\n      - \"23\"\n    separatecontext: false\n    conditions:\n    - label: \"yes\"\n      condition:\n      - - operator: isNotEmpty\n          left:\n            value:\n              complex:\n                root: Choose specific files to block.Answers\n                accessor: \"0\"\n            iscontext: true\n          right:\n            value: {}\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 1650,\n          \"y\": 1360\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"26\":\n    id: \"26\"\n    taskid: 4252ff7c-9f2f-4ad0-8dfa-f2a5ac8227b4\n    type: regular\n    task:\n      id: 4252ff7c-9f2f-4ad0-8dfa-f2a5ac8227b4\n      version: -1\n      name: Set query results to layout\n      description: Accepts a JSON object and returns a markdown.\n      scriptName: JsonToTable\n      type: regular\n      iscommand: false\n      brand: \"\"\n    nexttasks:\n      '#none#':\n      - \"16\"\n    scriptarguments:\n      extend-context:\n        simple: customquerymarkdown=\n      value:\n        complex:\n          root: MicrosoftATP.Hunt\n          accessor: Result\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 1220,\n          \"y\": 690\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    fieldMapping:\n    - incidentfield: Custom Query Results\n      output:\n        simple: ${customquerymarkdown}\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"27\":\n    id: \"27\"\n    taskid: 73d00fa3-bca8-4100-874a-97f8bfebc839\n    type: regular\n    task:\n      id: 73d00fa3-bca8-4100-874a-97f8bfebc839\n      version: -1\n      name: Delete context - markdown\n      description: |-\n        Delete field from context.\n\n        This automation runs using the default Limited User role, unless you explicitly change the permissions.\n        For more information, see the section about permissions here:\n        - For Cortex XSOAR 6 see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/6.x/Cortex-XSOAR-Playbook-Design-Guide/Automations \n        - For Cortex XSOAR 8 Cloud see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/8/Cortex-XSOAR-Cloud-Documentation/Create-a-script\n        - For Cortex XSOAR 8.7 On-prem see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/8.7/Cortex-XSOAR-On-prem-Documentation/Create-a-script\n      scriptName: DeleteContext\n      type: regular\n      iscommand: false\n      brand: \"\"\n    nexttasks:\n      '#none#':\n      - \"4\"\n    scriptarguments:\n      key:\n        simple: customquerymarkdown\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 740,\n          \"y\": 2220\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"29\":\n    id: \"29\"\n    taskid: 716ee229-5da3-412b-8867-4d7dcd3b94bc\n    type: regular\n    task:\n      id: 716ee229-5da3-412b-8867-4d7dcd3b94bc\n      version: -1\n      name: Block indicators\n      description: Creates a new indicator.\n      script: '|||microsoft-atp-sc-indicator-create'\n      type: regular\n      iscommand: true\n      brand: \"\"\n    nexttasks:\n      '#none#':\n      - \"6\"\n    scriptarguments:\n      action:\n        simple: Block\n      expiration_time:\n        complex:\n          root: inputs.Indicator Expiration\n      indicator_description:\n        complex:\n          root: inputs.Defender Indicator Title\n      indicator_title:\n        complex:\n          root: inputs.Defender Indicator Title\n      indicator_type:\n        simple: FileSha256\n      indicator_value:\n        complex:\n          root: IndicatorsToBlock\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 1220,\n          \"y\": 1710\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"30\":\n    id: \"30\"\n    taskid: 34b5f859-aa10-48cf-8f28-41ee793c6d73\n    type: condition\n    task:\n      id: 34b5f859-aa10-48cf-8f28-41ee793c6d73\n      version: -1\n      name: Is Defender For Endpoint enabled?\n      type: condition\n      iscommand: false\n      brand: \"\"\n      description: ''\n    nexttasks:\n      '#default#':\n      - \"4\"\n      \"yes\":\n      - \"14\"\n    separatecontext: false\n    conditions:\n    - label: \"yes\"\n      condition:\n      - - operator: isExists\n          left:\n            value:\n              complex:\n                root: modules\n                filters:\n                - - operator: isEqualString\n                    left:\n                      value:\n                        simple: modules.brand\n                      iscontext: true\n                    right:\n                      value:\n                        simple: Microsoft Defender Advanced Threat Protection\n                - - operator: isEqualString\n                    left:\n                      value:\n                        simple: modules.state\n                      iscontext: true\n                    right:\n                      value:\n                        simple: active\n                    ignorecase: true\n                accessor: brand\n            iscontext: true\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 440,\n          \"y\": 0\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"31\":\n    id: \"31\"\n    taskid: d56940ed-4d06-417b-8025-ad1efff4c0ad\n    type: regular\n    task:\n      id: d56940ed-4d06-417b-8025-ad1efff4c0ad\n      version: -1\n      name: Delete context to avoid duplications - customquerymarkdown\n      description: |-\n        Delete field from context.\n\n        This automation runs using the default Limited User role, unless you explicitly change the permissions.\n        For more information, see the section about permissions here:\n        - For Cortex XSOAR 6 see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/6.x/Cortex-XSOAR-Playbook-Design-Guide/Automations \n        - For Cortex XSOAR 8 Cloud see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/8/Cortex-XSOAR-Cloud-Documentation/Create-a-script\n        - For Cortex XSOAR 8.7 On-prem see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/8.7/Cortex-XSOAR-On-prem-Documentation/Create-a-script\n      scriptName: DeleteContext\n      type: regular\n      iscommand: false\n      brand: \"\"\n    nexttasks:\n      '#none#':\n      - \"30\"\n    scriptarguments:\n      key:\n        simple: customquerymarkdown\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 640,\n          \"y\": -180\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\n  \"32\":\n    id: \"32\"\n    taskid: 66aa84a3-2c01-473f-8346-29a174cdae15\n    type: regular\n    task:\n      id: 66aa84a3-2c01-473f-8346-29a174cdae15\n      version: -1\n      name: Delete context to avoid duplications - MicrosoftATP\n      description: |-\n        Delete field from context.\n\n        This automation runs using the default Limited User role, unless you explicitly change the permissions.\n        For more information, see the section about permissions here:\n        - For Cortex XSOAR 6 see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/6.x/Cortex-XSOAR-Playbook-Design-Guide/Automations \n        - For Cortex XSOAR 8 Cloud see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/8/Cortex-XSOAR-Cloud-Documentation/Create-a-script\n        - For Cortex XSOAR 8.7 On-prem see https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/8.7/Cortex-XSOAR-On-prem-Documentation/Create-a-script\n      scriptName: DeleteContext\n      type: regular\n      iscommand: false\n      brand: \"\"\n    nexttasks:\n      '#none#':\n      - \"30\"\n    scriptarguments:\n      key:\n        simple: MicrosoftATP\n    separatecontext: false\n    continueonerrortype: \"\"\n    view: |-\n      {\n        \"position\": {\n          \"x\": 250,\n          \"y\": -180\n        }\n      }\n    note: false\n    timertriggers: []\n    ignoreworker: false\n    skipunavailable: false\n    quietmode: 0\n    isoversize: false\n    isautoswitchedtoquietmode: false\nsystem: true\nview: |-\n  {\n    \"linkLabelsPosition\": {\n      \"14_6_#default#\": 0.14,\n      \"17_18_Yes - Choose specific files\": 0.52,\n      \"17_6_#default#\": 0.25,\n      \"24_29_#default#\": 0.9,\n      \"3_26_yes\": 0.54,\n      \"3_6_#default#\": 0.15\n    },\n    \"paper\": {\n      \"dimensions\": {\n        \"height\": 2785,\n        \"width\": 1780,\n        \"x\": 250,\n        \"y\": -330\n      }\n    }\n  }\ninputs:\n- key: Filename\n  value: {}\n  required: false\n  description: File name to search\n  playbookInputQuery:\n- key: TimeFrame\n  value: {}\n  required: false\n  description: 'Time in relative date or range format (for example: \"1 day\", \"3 weeks ago\", \"between 2021-01-01 12:34:56 +02:00 and 2021-02-01 12:34:56 +02:00\"). The default is the last 24 hours.'\n  playbookInputQuery:\n- key: Defender Indicator Title\n  value:\n    simple: XSOAR Software Block\n  required: false\n  description: The indicator alert title in Defender.\n  playbookInputQuery:\n- key: Indicator Expiration\n  value: {}\n  required: false\n  description: 'DateTime string indicating when the indicator expires. Format: (<number> <time unit>, e.g., 12 hours, 7 days).'\n  playbookInputQuery:\noutputs: []\ntests:\n- No tests (auto formatted)\nfromversion: 6.9.0\n",
  "product": "Cortex XSOAR",
  "pack": "MicrosoftDefenderAdvancedThreatProtection",
  "support_tier": "xsoar",
  "use_cases": [],
  "fromversion": "6.9.0",
  "source_repo": "demisto/content (MIT)",
  "tags": [
    "endpoint",
    "playbook",
    "product:cortex-xsoar",
    "soar",
    "support:xsoar"
  ],
  "embedding_model": "text-embedding-004",
  "embedding": "RbQBPYG1vDx2KUi9OWbYOe1dvD0UNso8++OgPYsHMDyY/Ou7OJQsPP5MoLzM0ig9PPjQPLvV+Lw4zMM8YUievXY4Xz2Txyc9kiP3O0SkpLxkxnW9CWtzvRuXYzzI+qW8CI3wvLa/M70KPvw8iZJ6vfjfvrpPQsO7gsysulBSsboMcgs7eZWNO+hJEL29eeK8a6gnvSp7/rzgNLC8U6ovvK4Rlr3UQ4K9n6HKvM+BWz22PDa7EGUXvBiKx7yDz6I8AxX9vCF52zyu5JA9sBq7vAVnkzo+BjY9JCnvPPYqab2vprI7gXRKvWJh5bw306o7ItDYOq1EwbztI6O8Q9m3O1+iJTuSUE27X3ypvIBXEr0A3bW8vihEPXhs8rw5WWE9p9vUvGRom7wKoz+94co9PLT1iTtAiK08hzAcPK9YHTyZjlU78Af/PK6/Kz3bqSk9+Wz/uwmlML2UVn48QXyfvZrTSLxosxQ7oaEGPtDsP7yBvEQ8E4OqPT9fvT3FGA+9lahCvWVH7L1BqAy8hwnfPFK127wyLAy9iYn2O+B1vLxF/D27SFZvPFNvkzn+IZm9VnNivaFBnbtLPgC9JwWDvCDdP7wR93M9IpdJvQrk9zvcWDQ58xKUPBGzAr08Nn296zo4u2FjJz1ceiw6aQBmPeaGIT1a1GU95PF0PEVwqDslGeY8dhcOvXGPabyTaLu6iOTHO8s8Ab0nmqM74wNJu1uJ3rs6ucS81jW1O1fZTjyhwI+8XmM3uWUb3r29VSO88XHbPM6hlbdq24E9pOFtPUQtd71rhTm945CSvD1bSr0PHF29EiGJPJ6MDL1jmJS75QgpPNgkTL1Z+iY9CFMlvXE4Q7yJHt280I/7vDAtjTzNaIa8doO/vPJ+Tr1xnUk8Kvk8vUt75TzEdO07LDeiOwyZwL3C4ja9U/XcvOO9jzxs4ys72OmcO3oYFL3XArE8JtSFPTSdaDwXX9w8g0/KvXgbBT2ACyU86tRDvLxIt7zBOik9uGQFPZ6sGD0v8h07k3RQOnd9DD1b0iO9QBydvAx2nTwNemc7NLx8vUHtjbyEsrk9oroIvYgnbDxmvFW9Ww+SvT9arbr3F1a9rOgkvWwyajyY0SG9UNNkvMp/8zwsBdI7PFMiPKDlBLyo4xW8rZKyPEqrMT166vE9eyzgvNy0UT3Rk6O8+Jwlu+B1lTsAcFm8WYFsPZ20G737ljg9ZlAPOqDydb31zQa85bbIPGy+tbvEGUM8HhoDOy6R/Du4Ryo9ctd5vC+WDL1lNuo6vdbzvMy3zDx/cGc8fwGTPGMbpD35Ttu8KwvSOzpnZ7z5vMe6vB9avYD2sjzW/447lQU/ut8R2juTFAO97OBjOymbNT3O+Yy9wfVmPaA3Ar24VSo97XNkvUE/r7wiHKm8NYwDvbIyIr2WMxm98cu4vJjrjjyK5bQ8h3z3PG24s7xrT0a8naS6Ow1tzr07ntK5V8QevACcdT3y+IC97YVmvSqokTwIRzq7qGj5OBSvcbxUPEC7BmbzvCYyY7x7+2y9KC2JuhZLFL2foRY9i3WFPSB0nrxUb8u9GQ6VPLQgKz3ZHEI9g/5HPXebB71GMhK9GAEcPUcwJT3Gb3e9/29RPIM4LLwvkVY8fkAJPHNvNTxI6LG7S5OOvH+b4DunWus6ImSuusnwNrtlVou6is4au8HSsr0iMWy8qbdmvFCKUDznXqg8X5GDPNYyF70pHoM8Bw0AORWrObzI5p671lLTvJFiIj1L21S9eaKtPAWllTwDtwY8aOQhO7vlvLuScgM9Cxr2vOXQ7zwUa3w9/gPUvLbpy7mEIOq7/7+KPEzVGz1O4fu87ooIvYqvCj3KrlS8miWOParqezyHW2A9W+4CPCtpwjwIIAI9vDnGPEpMcbzJeUA8cjBXvZt7pLyByay6PuhbudgxATwBCuo5SMhRPWoptTxOGBS9BKNWPYSxiz28+cs8QbEvvQt+oLz5ZmC8tQ8Nu4bd/7xab+E8gQKpvRYfTL0hTtS7/4nKPGzYVL32PNS8eAgNvJgEI7kIOaA7AjFRPZFVZz34ejy9OsUBvUm1qjukdxs9knaOvUM34j2M9xi8ix3rPFPYn7xdZlu8EmkKvaClkD0mqBs9oObrvFPPPTvYeVC8VCycPdfJm73o3Y47QA5HOoNS8Tw7QNw8H1VpvfDDxDwS3ps7lW7DPCmrPjzxAMY8LG/uuyMh5boEWk09MuYFPK2na7zXMEw9p0QPvN2VZ7vTsX+8EmZUPDn+jLzBUa+9aNhMvY8E3rxIYtI8lgMGvWfXkbyvwEU8bS+yvH/pED3CXhW8VGReOykxTD3SueG8mnyju2HXzzyKrSm7VznOPMVRAD2CnEQ9C2ixvGFrk7v657E5KjZFPHByiDuwXba8YZ+wvLqEqrydGR285nzavJW+Bb6BxeA7SxjKPAC847tYDwE8Zfs1vCcMHL3BivU8QCY3Pcs7iLvt/Yg8/TwuvTAIqrzIE6I9k+mIvCcAeLsWMxE9DuxDPa9AzDxJDk89ZTVYvfPe4Twe/5o8cmi9PCr6UjxwQ5G85DNgvbvTxLsbxPo7fP4UOm902jySDUy9qC09vYxxWLxqSuE8tW+bvGcSj7294Le8mpc8vYuWSr1x9dO8Cu9FvU0sRj2wYF28HimlvDnyKz1cq5c9FbE1PSBorTyviRu98yl+PA03XbxtdxG9OUcIPW1PUjwQfYA9NR2cPBcCIbyfWJw9ntmBvOM8Kr3QrEI8wZCnPEL/V72rEn48JVSJPR77NLqXyzk7C88GPNOGQb3FiF+9gEI1vHY+er0u5H28PTebvMD5mrxT7UI7IPtcPWyJ9LyFrJk8+bUvPLendz11cGI9bamkPGrblD34vpA8EaavvI0ahDwFehA9rt8CPEzbwjxjC7c8iG8JPNrwET30odc8pnIsPZo9c70QGVq8EA47PNlSirvwbvy8Y5v2vMqpYzyKqyG9qcQ3vKtHObwuBni77FTku786ALz149u7U72dvB81K729kMm8LuM3POqcrbv8B2U7E1egPFyi4TyV4Ky7D9mIvC8A2LpSr2M76R72vCBJBzzN+Wu83DS4vFUSrDzLlB28yBWlPfTR6jtmZNy8y8KGvMq6MbvTKHU7XXtxvSYUIDtYj/i8IJ7nvFceRDzp8uK8bTdwPFWtPzxR11O91RmePZp9wruS8zy8/JZOvARtArxZeF89RffPOxJ/tryJIpy9/FNOvGqRdr2QyqY8StMdPHsf5Lsd7U89tRQwPIEQqbzTgoG91jtbPR53kLydnge9n3qbPLyWLju9uQc9nIBbPEkp1bke6pi8BN1+PFqEBL3R3IK9YO0QvZJmwjwfatw8ZTiXvDgQmbw8c4I9gFwavVdPbb07Ro28Pb0yPU1ShDwq0Yo7w8EivdXEVj2uUWm8lsOKPT5Yh7tk0Nu9e2e2O38SijyYjoy9rYvVuwyA2Tx0WhU9Xq1oPQSZgb16OvS7FsVmvVSLNLzNgLS5181ovLVk3byH1FC9b2QBPQSSUrxSHLe95fpyu+n7IL2pYIc8K90pvfPJFLxfiEQ9LSkBPXosxDvTPsA8FLvmPAarIT3vtGE8mUgkvG6VPL2Bv3U9yjjcvB41lruwtqE8XQE5vQ4p4TzV+iu8JowAu3EAPT2i4PI7Xrp0vIyOYTxYEbQ6sa29O69YAT0FjEY8s9/EvKDfFboHWX873X0kvXdh57xqqAW8KZfnPHR6TTyATbC6EvL/vGG0pjypgQQ8zjGwvGBak7xRK+o8hSrpvSDTKL3Mi568rV9WPWU5mTz8dYu8kR8KPUDH5jzzRA68gSzuPF90Xz372lq8cA5HPbSnHDwGqWg9zAtLPYMBCLtPSUQ9HM4bvL51JDsTdgm9F10YvO6nAD2h0Sg9sgZBvZG10Dywis87usEWvbT8FbwTM+u8KU1Qvbw/xbwrbXa7U25JvXizgL015B+6t1ONu96tlj2RaNk85GD2PBzcBD1KSly9GwcUvWFJjLzSwzS8c9OpPd7mM7zY3VK8EEG5vJKBW7xzSZM9PEXnPI16c7yoLTs8+RVEve4127y3Y568NI2CvV/FDz3cdbE8"
}
